Revit 2017 API
TagMode Enumeration
 An enumerated type listing tag mode that are supported for IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public enum TagMode
Visual Basic
Public Enumeration TagMode
Visual C++
public enum class TagMode
Members
Member name | Description
TM_ADDBY_CATEGORY |  The Tag you add by Category.
TM_ADDBY_MULTICATEGORY |  The Tag you add by Multi-Category.
TM_ADDBY_MATERIAL |  The Tag you add by Material.
See Also
Autodesk.Revit.DB Namespace